fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВКМ_ГрафикОтпусков</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтпускаСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПроверитьЛимитОтпусковНаСервере()
	
	// 1. Создаем таблицу для промежуточных расчетов
	ТЗ = Объект.ОтпускаСотрудников.Выгрузить();
	ТЗ.Колонки.Добавить("ДнейОтпуска", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	
	// 2. Считаем длительность каждого отпуска в строках
	Для Каждого Стр Из ТЗ Цикл
		Если ЗначениеЗаполнено(Стр.ДатаНачала) И ЗначениеЗаполнено(Стр.ДатаОкончания) Тогда
			// Разница в секундах / 86400 = дни. +1 день, так как даты включительно
			Стр.ДнейОтпуска = (КонецДня(Стр.ДатаОкончания) - НачалоДня(Стр.ДатаНачала) + 1) / 86400;
		КонецЕсли;
	КонецЦикла;
	
	// 3. Сворачиваем таблицу по сотрудникам, суммируя дни
	ТЗ.Свернуть("Сотрудник", "ДнейОтпуска");
	
	// 4. Проходим по строкам формы и ставим признак превышения
	Для Каждого СтрокаТЧ Из Объект.ОтпускаСотрудников Цикл
		СтрокаИтогов = ТЗ.Найти(СтрокаТЧ.Сотрудник, "Сотрудник");
		Если СтрокаИтогов <> Неопределено И СтрокаИтогов.ДнейОтпуска > 28 Тогда
			СтрокаТЧ.ПревышениеЛимита = Истина;
		Иначе
			СтрокаТЧ.ПревышениеЛимита = Ложь;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Эти события должны быть привязаны к колонкам ТЧ на форме!
&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	ПроверитьЛимитОтпусковНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Чтобы окрасилось сразу при открытии существующего документа
	ПроверитьЛимитОтпусковНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    // Если открыли новый документ, на всякий случай сбросим данные
    ПроверитьЛимитОтпусковНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)  
	
	// 1. Вызываем серверную функцию, чтобы получить адрес данных
	АдресХранилища = ПодготовитьДанныеНаСервере();
	
	// 2. Подготавливаем параметры для открытия формы
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресДанных", АдресХранилища);
	
	// 3. Открываем форму АнализГрафика
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ВКМ_АнализГрафика", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры       

&НаСервере
Функция ПодготовитьДанныеНаСервере()
	
	ДанныеДляПередачи = Объект.ОтпускаСотрудников.Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ДанныеДляПередачи, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции
